ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_CAN.cpp
    FunctionalState CAN_ABOM;  /*!< Enable or disable the automatic bus-off management.
                                    This parameter can be set either to ENABLE or DISABLE. */

    FunctionalState CAN_AWUM;  /*!< Enable or disable the automatic wake-up mode.
                                    This parameter can be set either to ENABLE or DISABLE. */

    FunctionalState CAN_NART;  /*!< Enable or disable the non-automatic retransmission mode.
                                    This parameter can be set either to ENABLE or DISABLE. */

    FunctionalState CAN_RFLM;  /*!< Enable or disable the Receive FIFO Locked mode.
                                    This parameter can be set either to ENABLE or DISABLE. */

    FunctionalState CAN_TXFP;  /*!< Enable or disable the transmit FIFO priority.
                                    This parameter can be set either to ENABLE or DISABLE. */
} STM32F7_Can_InitTypeDef;

/**
  * @brief  CAN filter init structure definition
  */
typedef struct {
    uint16_t CAN_FilterIdHigh;         /*!< Specifies the filter identification number (MSBs for a 32-bit
                                                configuration, first one for a 16-bit configuration).
                                                This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterIdLow;          /*!< Specifies the filter identification number (LSBs for a 32-bit
                                                configuration, second one for a 16-bit configuration).
                                                This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterMaskIdHigh;     /*!< Specifies the filter mask number or identification number,
                                                according to the mode (MSBs for a 32-bit configuration,
                                                first one for a 16-bit configuration).
                                                This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterMaskIdLow;      /*!< Specifies the filter mask number or identification number,
                                                according to the mode (LSBs for a 32-bit configuration,
                                                second one for a 16-bit configuration).
                                                This parameter can be a value between 0x0000 and 0xFFFF */

    uint16_t CAN_FilterFIFOAssignment; /*!< Specifies the FIFO (0 or 1) which will be assigned to the filter.
                                                This parameter can be a value of @ref CAN_filter_FIFO */

    uint8_t CAN_FilterNumber;          /*!< Specifies the filter which will be initialized. It ranges from 0 to 13. */

    uint8_t CAN_FilterMode;            /*!< Specifies the filter mode to be initialized.
                                                This parameter can be a value of @ref CAN_filter_mode */

    uint8_t CAN_FilterScale;           /*!< Specifies the filter scale.
                                                This parameter can be a value of @ref CAN_filter_scale */

    FunctionalState CAN_FilterActivation; /*!< Enable or disable the filter.
                                                This parameter can be set either to ENABLE or DISABLE. */
} STM32F7_Can_FilterInitTypeDef;

/**
  * @brief  CAN Tx message structure definition
  */
typedef struct {
    uint32_t StdId;  /*!< Specifies the standard identifier.
                          This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId;  /*!< Specifies the extended identifier.
                          This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t IDE;     /*!< Specifies the type of identifier for the message that
                          will be transmitted. This parameter can be a value
                          of @ref CAN_identifier_type */

    uint8_t RTR;     /*!< Specifies the type of frame for the message that will
                          be transmitted. This parameter can be a value of
                          @ref CAN_remote_transmission_request */

    uint8_t DLC;     /*!< Specifies the length of the frame that will be
                          transmitted. This parameter can be a value between
                          0 to 8 */

    uint8_t Data[8]; /*!< Contains the data to be transmitted. It ranges from 0
                          to 0xFF. */
} STM32F7_Can_TxMessage;

/**
  * @brief  CAN Rx message structure definition
  */
typedef struct {
    uint32_t StdId;  /*!< Specifies the standard identifier.
                          This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId;  /*!< Specifies the extended identifier.
                          This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t IDE;     /*!< Specifies the type of identifier for the message that
                          will be received. This parameter can be a value of
                          @ref CAN_identifier_type */

    uint8_t RTR;     /*!< Specifies the type of frame for the received message.
                          This parameter can be a value of
                          @ref CAN_remote_transmission_request */

    uint8_t DLC;     /*!< Specifies the length of the frame that will be received.
                          This parameter can be a value between 0 to 8 */

    uint8_t Data[8]; /*!< Contains the data to be received. It ranges from 0 to
                          0xFF. */

    uint8_t FMI;     /*!< Specifies the index of the filter the message stored in
                          the mailbox passes through. This parameter can be a
                          value between 0 to 0xFF */
} STM32F7_Can_RxMessage;


struct STM32F7_Can_Filter {
    uint32_t* matchFilters;
    uint32_t matchFiltersSize;

    uint32_t* lowerBoundFilters;
    uint32_t* upperBoundFilters;
    uint32_t groupFiltersSize;

};


typedef struct {
    uint32_t TimeStampL;
    uint32_t TimeStampH;

