ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_CAN.cpp
uint32_t CAN_GetTransferTimeout() {
    return CAN_TRANSFER_TIMEOUT;
}

/**
  * @brief  Cancels a transmit request.
  * @param  CANx: where x can be 1 or 2 to select the CAN peripheral.
  * @param  Mailbox: Mailbox number.
  * @retval None
  */
void CAN_CancelTransmit(CAN_TypeDef* CANx, uint8_t Mailbox) {
    /* Check the parameters */
    // TQD assert_param(IS_CAN_ALL_PERIPH(CANx));
    // TQD assert_param(IS_CAN_TRANSMITMAILBOX(Mailbox));
    /* abort transmission */
    switch (Mailbox) {
    case (CAN_TXMAILBOX_0): CANx->TSR |= CAN_TSR_ABRQ0;
        break;
    case (CAN_TXMAILBOX_1): CANx->TSR |= CAN_TSR_ABRQ1;
        break;
    case (CAN_TXMAILBOX_2): CANx->TSR |= CAN_TSR_ABRQ2;
        break;
    default:
        break;
    }
}
/**
  * @brief  Clears the CANx's interrupt pending bits.
  * @param  CANx: where x can be 1 or 2 to to select the CAN peripheral.
  * @param  CAN_IT: specifies the interrupt pending bit to clear.
  *          This parameter can be one of the following values:
  *            @arg CAN_IT_TME: Transmit mailbox empty Interrupt
  *            @arg CAN_IT_FF0: FIFO 0 full Interrupt
  *            @arg CAN_IT_FOV0: FIFO 0 overrun Interrupt
  *            @arg CAN_IT_FF1: FIFO 1 full Interrupt
  *            @arg CAN_IT_FOV1: FIFO 1 overrun Interrupt
  *            @arg CAN_IT_WKU: Wake-up Interrupt
  *            @arg CAN_IT_SLK: Sleep acknowledge Interrupt
  *            @arg CAN_IT_EWG: Error warning Interrupt
  *            @arg CAN_IT_EPV: Error passive Interrupt
  *            @arg CAN_IT_BOF: Bus-off Interrupt
  *            @arg CAN_IT_LEC: Last error code Interrupt
  *            @arg CAN_IT_ERR: Error Interrupt
  * @retval None
  */
void CAN_ClearITPendingBit(CAN_TypeDef* CANx, uint32_t CAN_IT) {
    /* Check the parameters */
    // TQD assert_param(IS_CAN_ALL_PERIPH(CANx));
    // TQD assert_param(IS_CAN_CLEAR_IT(CAN_IT));

    switch (CAN_IT) {
    case CAN_IT_TME:
        /* Clear CAN_TSR_RQCPx (rc_w1)*/
        CANx->TSR = CAN_TSR_RQCP0 | CAN_TSR_RQCP1 | CAN_TSR_RQCP2;
        break;
    case CAN_IT_FF0:
        /* Clear CAN_RF0R_FULL0 (rc_w1)*/
        CANx->RF0R = CAN_RF0R_FULL0;
        break;
    case CAN_IT_FOV0:
        /* Clear CAN_RF0R_FOVR0 (rc_w1)*/
        CANx->RF0R = CAN_RF0R_FOVR0;
        break;
    case CAN_IT_FF1:
        /* Clear CAN_RF1R_FULL1 (rc_w1)*/
        CANx->RF1R = CAN_RF1R_FULL1;
        break;
    case CAN_IT_FOV1:
        /* Clear CAN_RF1R_FOVR1 (rc_w1)*/
        CANx->RF1R = CAN_RF1R_FOVR1;
        break;
    case CAN_IT_WKU:
        /* Clear CAN_MSR_WKUI (rc_w1)*/
        CANx->MSR = CAN_MSR_WKUI;
        break;
    case CAN_IT_SLK:
        /* Clear CAN_MSR_SLAKI (rc_w1)*/
        CANx->MSR = CAN_MSR_SLAKI;
        break;
    case CAN_IT_EWG:
        /* Clear CAN_MSR_ERRI (rc_w1) */
        CANx->MSR = CAN_MSR_ERRI;
        /* @note the corresponding Flag is cleared by hardware depending on the CAN Bus status*/
        break;
    case CAN_IT_EPV:
        /* Clear CAN_MSR_ERRI (rc_w1) */
        CANx->MSR = CAN_MSR_ERRI;
        /* @note the corresponding Flag is cleared by hardware depending on the CAN Bus status*/
        break;
    case CAN_IT_BOF:
        /* Clear CAN_MSR_ERRI (rc_w1) */
        CANx->MSR = CAN_MSR_ERRI;
        /* @note the corresponding Flag is cleared by hardware depending on the CAN Bus status*/
        break;
    case CAN_IT_LEC:
        /*  Clear LEC bits */
        CANx->ESR = RESET;
        /* Clear CAN_MSR_ERRI (rc_w1) */
        CANx->MSR = CAN_MSR_ERRI;
        break;
    case CAN_IT_ERR:
        /*Clear LEC bits */
        CANx->ESR = RESET;
        /* Clear CAN_MSR_ERRI (rc_w1) */
        CANx->MSR = CAN_MSR_ERRI;
        /* @note BOFF, EPVF and EWGF Flags are cleared by hardware depending on the CAN Bus status*/
        break;
    default:
        break;
    }
}

/**
  * @brief  Checks whether the CAN interrupt has occurred or not.
  * @param  CAN_Reg: specifies the CAN interrupt register to check.
  * @param  It_Bit: specifies the interrupt source bit to check.
  * @retval The new state of the CAN Interrupt (SET or RESET).
  */
static ITStatus CheckITStatus(uint32_t CAN_Reg, uint32_t It_Bit) {
    ITStatus pendingbitstatus = RESET;

    if ((CAN_Reg & It_Bit) != (uint32_t)RESET) {
        /* CAN_IT is set */
        pendingbitstatus = SET;
    }
    else {
        /* CAN_IT is reset */
        pendingbitstatus = RESET;
    }
    return pendingbitstatus;
}


/**
  * @brief  Checks whether the specified CANx interrupt has occurred or not.
  * @param  CANx: where x can be 1 or 2 to to select the CAN peripheral.
  * @param  CAN_IT: specifies the CAN interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg CAN_IT_TME: Transmit mailbox empty Interrupt
  *            @arg CAN_IT_FMP0: FIFO 0 message pending Interrupt
  *            @arg CAN_IT_FF0: FIFO 0 full Interrupt
  *            @arg CAN_IT_FOV0: FIFO 0 overrun Interrupt
  *            @arg CAN_IT_FMP1: FIFO 1 message pending Interrupt
  *            @arg CAN_IT_FF1: FIFO 1 full Interrupt
  *            @arg CAN_IT_FOV1: FIFO 1 overrun Interrupt
  *            @arg CAN_IT_WKU: Wake-up Interrupt
  *            @arg CAN_IT_SLK: Sleep acknowledge Interrupt
  *            @arg CAN_IT_EWG: Error warning Interrupt
  *            @arg CAN_IT_EPV: Error passive Interrupt
  *            @arg CAN_IT_BOF: Bus-off Interrupt
  *            @arg CAN_IT_LEC: Last error code Interrupt
  *            @arg CAN_IT_ERR: Error Interrupt
  * @retval The current state of CAN_IT (SET or RESET).
  */
ITStatus CAN_GetITStatus(CAN_TypeDef* CANx, uint32_t CAN_IT) {
    ITStatus itstatus = RESET;
    /* Check the parameters */
    // TQD assert_param(IS_CAN_ALL_PERIPH(CANx));
    // TQD assert_param(IS_CAN_IT(CAN_IT));

    /* check the interrupt enable bit */
    if ((CANx->IER & CAN_IT) != RESET) {
        /* in case the Interrupt is enabled, .... */
        switch (CAN_IT) {
        case CAN_IT_TME:
            /* Check CAN_TSR_RQCPx bits */
            itstatus = CheckITStatus(CANx->TSR, CAN_TSR_RQCP0 | CAN_TSR_RQCP1 | CAN_TSR_RQCP2);
            break;
        case CAN_IT_FMP0:
            /* Check CAN_RF0R_FMP0 bit */
            itstatus = CheckITStatus(CANx->RF0R, CAN_RF0R_FMP0);
            break;
        case CAN_IT_FF0:
            /* Check CAN_RF0R_FULL0 bit */
            itstatus = CheckITStatus(CANx->RF0R, CAN_RF0R_FULL0);
            break;
        case CAN_IT_FOV0:
            /* Check CAN_RF0R_FOVR0 bit */
            itstatus = CheckITStatus(CANx->RF0R, CAN_RF0R_FOVR0);
            break;
        case CAN_IT_FMP1:
            /* Check CAN_RF1R_FMP1 bit */
            itstatus = CheckITStatus(CANx->RF1R, CAN_RF1R_FMP1);
            break;
        case CAN_IT_FF1:
            /* Check CAN_RF1R_FULL1 bit */
            itstatus = CheckITStatus(CANx->RF1R, CAN_RF1R_FULL1);
            break;
        case CAN_IT_FOV1:
            /* Check CAN_RF1R_FOVR1 bit */
            itstatus = CheckITStatus(CANx->RF1R, CAN_RF1R_FOVR1);
            break;
        case CAN_IT_WKU:
            /* Check CAN_MSR_WKUI bit */
            itstatus = CheckITStatus(CANx->MSR, CAN_MSR_WKUI);
            break;
        case CAN_IT_SLK:
            /* Check CAN_MSR_SLAKI bit */
            itstatus = CheckITStatus(CANx->MSR, CAN_MSR_SLAKI);
            break;
        case CAN_IT_EWG:
            /* Check CAN_ESR_EWGF bit */
            itstatus = CheckITStatus(CANx->ESR, CAN_ESR_EWGF);
            break;
        case CAN_IT_EPV:
            /* Check CAN_ESR_EPVF bit */
            itstatus = CheckITStatus(CANx->ESR, CAN_ESR_EPVF);
            break;
        case CAN_IT_BOF:
            /* Check CAN_ESR_BOFF bit */
            itstatus = CheckITStatus(CANx->ESR, CAN_ESR_BOFF);
            break;
        case CAN_IT_LEC:
            /* Check CAN_ESR_LEC bit */
            itstatus = CheckITStatus(CANx->ESR, CAN_ESR_LEC);
            break;
        case CAN_IT_ERR:
            /* Check CAN_MSR_ERRI bit */
            itstatus = CheckITStatus(CANx->MSR, CAN_MSR_ERRI);
            break;
        default:
            /* in case of error, return RESET */
            itstatus = RESET;
            break;
        }
    }
    else {
        /* in case the Interrupt is not enabled, return RESET */
        itstatus = RESET;
    }

    /* Return the CAN_IT status */
    return  itstatus;
}


bool CAN_ErrorHandler(uint8_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = &canStates[controllerIndex];

