ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_CAN.cpp
    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    if (CAN_GetITStatus(CANx, CAN_IT_FF0)) {
        CAN_ClearITPendingBit(CANx, CAN_IT_FF0);
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::BufferFull;

        return true;
    }
    else if (CAN_GetITStatus(CANx, CAN_IT_FOV0)) {
        CAN_ClearITPendingBit(CANx, CAN_IT_FOV0);
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::Overrun;

        return true;
    }
    else if (CAN_GetITStatus(CANx, CAN_IT_BOF)) {
        CAN_ClearITPendingBit(CANx, CAN_IT_BOF);
        state->errorEvent = 1 << (uint8_t)(uint8_t)TinyCLR_Can_Error::BusOff;

        return true;
    }
    else if (CAN_GetITStatus(CANx, CAN_IT_EPV)) {
        CAN_ClearITPendingBit(CANx, CAN_IT_EPV);
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::Passive;

        return true;
    }

    else if (CAN_GetITStatus(CANx, CAN_IT_LEC)) {
        CAN_ClearITPendingBit(CANx, CAN_IT_LEC);
    }
    else if (CAN_GetITStatus(CANx, CAN_IT_ERR)) {
        CAN_ClearITPendingBit(CANx, CAN_IT_ERR);
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::Passive;

        return true;
    }
    else if (CAN_GetITStatus(CANx, CAN_IT_EWG)) {
        CAN_ClearITPendingBit(CANx, CAN_IT_EWG);
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::Passive;
    }

    return false;
}

const char* canApiNames[] = {
#if TOTAL_CAN_CONTROLLERS > 0
"GHIElectronics.TinyCLR.NativeApis.STM32F7.CanController\\0",
#if TOTAL_CAN_CONTROLLERS > 1
"GHIElectronics.TinyCLR.NativeApis.STM32F7.CanController\\1"
#endif
#endif
};

void STM32F7_Can_AddApi(const TinyCLR_Api_Manager* apiManager) {
    for (int32_t i = 0; i < TOTAL_CAN_CONTROLLERS; i++) {
        canControllers[i].ApiInfo = &canApi[i];
        canControllers[i].Acquire = &STM32F7_Can_Acquire;
        canControllers[i].Release = &STM32F7_Can_Release;
        canControllers[i].Enable = &STM32F7_Can_Enable;
        canControllers[i].Disable = &STM32F7_Can_Disable;
        canControllers[i].CanWriteMessage = &STM32F7_Can_CanWriteMessage;
        canControllers[i].CanReadMessage = &STM32F7_Can_CanReadMessage;
        canControllers[i].WriteMessage = &STM32F7_Can_WriteMessage;
        canControllers[i].ReadMessage = &STM32F7_Can_ReadMessage;
        canControllers[i].SetBitTiming = &STM32F7_Can_SetBitTiming;
        canControllers[i].GetMessagesToRead = &STM32F7_Can_GetMessagesToRead;
        canControllers[i].GetMessagesToWrite = &STM32F7_Can_GetMessagesToWrite;
        canControllers[i].SetMessageReceivedHandler = &STM32F7_Can_SetMessageReceivedHandler;
        canControllers[i].SetErrorReceivedHandler = &STM32F7_Can_SetErrorReceivedHandler;
        canControllers[i].SetExplicitFilters = &STM32F7_Can_SetExplicitFilters;
        canControllers[i].SetGroupFilters = &STM32F7_Can_SetGroupFilters;
        canControllers[i].ClearReadBuffer = &STM32F7_Can_ClearReadBuffer;
        canControllers[i].GetWriteErrorCount = &STM32F7_Can_GetWriteErrorCount;
        canControllers[i].GetReadErrorCount = &STM32F7_Can_GetReadErrorCount;
        canControllers[i].GetSourceClock = &STM32F7_Can_GetSourceClock;
        canControllers[i].GetReadBufferSize = &STM32F7_Can_GetReadBufferSize;
        canControllers[i].SetReadBufferSize = &STM32F7_Can_SetReadBufferSize;
        canControllers[i].GetWriteBufferSize = &STM32F7_Can_GetWriteBufferSize;
        canControllers[i].SetWriteBufferSize = &STM32F7_Can_SetWriteBufferSize;

        canApi[i].Author = "GHI Electronics, LLC";
        canApi[i].Name = canApiNames[i];
        canApi[i].Type = TinyCLR_Api_Type::CanController;
        canApi[i].Version = 0;
        canApi[i].Implementation = &canControllers[i];
        canApi[i].State = &canStates[i];

        canStates[i].controllerIndex = i;
        canStates[i].initializeCount = 0;
        canStates[i].canRxMessagesFifo = nullptr;

        apiManager->Add(apiManager, &canApi[i]);
    }
}

void CAN_DisableExplicitFilters(int32_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = &canStates[controllerIndex];

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->canDataFilter.matchFiltersSize && state->canDataFilter.matchFilters != nullptr) {
        memoryProvider->Free(memoryProvider, state->canDataFilter.matchFilters);

        state->canDataFilter.matchFiltersSize = 0;
    }
}

void CAN_DisableGroupFilters(int32_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = &canStates[controllerIndex];

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->canDataFilter.groupFiltersSize) {
        if (state->canDataFilter.lowerBoundFilters != nullptr)
            memoryProvider->Free(memoryProvider, state->canDataFilter.lowerBoundFilters);

        if (state->canDataFilter.upperBoundFilters != nullptr)
            memoryProvider->Free(memoryProvider, state->canDataFilter.upperBoundFilters);

        state->canDataFilter.groupFiltersSize = 0;
    }
}

size_t STM32F7_Can_GetReadBufferSize(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;

    return state->rxBufferSize == 0 ? canDefaultBuffersSize[controllerIndex] : state->rxBufferSize;
}

TinyCLR_Result STM32F7_Can_SetReadBufferSize(const TinyCLR_Can_Controller* self, size_t size) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    auto controllerIndex = state->controllerIndex;
    TinyCLR_Result result = TinyCLR_Result::Success;

    if (size > CAN_MINIMUM_MESSAGES_LEFT) {
        state->rxBufferSize = size;
        result = TinyCLR_Result::Success;
    }
    else {
        state->rxBufferSize = canDefaultBuffersSize[controllerIndex];
        result = TinyCLR_Result::ArgumentInvalid;
    }

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->canRxMessagesFifo != nullptr) {
        memoryProvider->Free(memoryProvider, state->canRxMessagesFifo);

