ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_CAN.cpp
        state->canRxMessagesFifo = nullptr;
    }

    state->canRxMessagesFifo = (STM32F7_Can_Message*)memoryProvider->Allocate(memoryProvider, state->rxBufferSize * sizeof(STM32F7_Can_Message));

    if (state->canRxMessagesFifo == nullptr) {
        result = TinyCLR_Result::OutOfMemory;
    }

    return result;

}

size_t STM32F7_Can_GetWriteBufferSize(const TinyCLR_Can_Controller* self) {
    return 1;
}

TinyCLR_Result STM32F7_Can_SetWriteBufferSize(const TinyCLR_Can_Controller* self, size_t size) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->txBufferSize = 1;

    return size == 1 ? TinyCLR_Result::Success : TinyCLR_Result::NotSupported;
}

void STM32F7_Can_RxInterruptHandler(int32_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = reinterpret_cast<CanState*>(&canStates[controllerIndex]);

    auto raiseErrorEvent = false;
    auto raiseMessageReceivedEvent = false;

    uint32_t* pDest;

    int32_t len = 0;

    uint32_t msgid = 0;

    bool extendMode = 0;
    bool rtrmode = 0;

    char passed = 0;

    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    STM32F7_Can_RxMessage rxMessage;

    uint32_t error = CAN_ErrorHandler(controllerIndex);

    uint64_t t;

    STM32F7_Can_Message *can_msg;

    CAN_Receive(CANx, CAN_FIFO0, &rxMessage);

    if (error) {
        raiseErrorEvent = true;
        goto raiseEvent;
    }

    len = rxMessage.DLC;

    if (rxMessage.IDE == CAN_Id_Standard) {
        msgid = rxMessage.StdId;
        extendMode = false;
    }
    else {
        msgid = rxMessage.ExtId;
        extendMode = true;
    }

    rtrmode = (((rxMessage.RTR) & CAN_Rtr_Frame) != 0) ? true : false;

    // Filter
    if (state->canDataFilter.groupFiltersSize || state->canDataFilter.matchFiltersSize) {
        if (state->canDataFilter.groupFiltersSize) {
            if (BinarySearch2(state->canDataFilter.lowerBoundFilters, state->canDataFilter.upperBoundFilters, 0, state->canDataFilter.groupFiltersSize - 1, msgid) >= 0)
                passed = 1;
        }

        if (!passed && state->canDataFilter.matchFiltersSize) {
            if (BinarySearch(state->canDataFilter.matchFilters, 0, state->canDataFilter.matchFiltersSize - 1, msgid) >= 0)
                passed = 1;
        }

        if (!passed) {
            return;
        }
    }

    // timestamp
    t = STM32F7_Time_GetSystemTime(nullptr);

    if (!state->enable) return; // Not copy to internal buffer if enable if off

    if (state->rxCount == state->rxBufferSize) { // Return if internal buffer is full
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::BufferFull;
        raiseErrorEvent = true;

        // raise event full, buffer is full, no more data receive.
        goto raiseEvent;
    }
    else if (state->rxCount >= state->rxBufferSize - CAN_MINIMUM_MESSAGES_LEFT) { // Raise full event soon when internal buffer has only 3 availble msg left
        raiseErrorEvent = true;
        state->errorEvent = 1 << (uint8_t)TinyCLR_Can_Error::BufferFull;
        // No return, continue take CAN_MINIMUM_MESSAGES_LEFT but warning buffer full.
    }

    can_msg = &state->canRxMessagesFifo[state->rxIn];

    can_msg->TimeStampL = t & 0xFFFFFFFF;

    can_msg->TimeStampH = t >> 32;

    can_msg->MsgID = msgid;

    can_msg->extendedId = extendMode;

    can_msg->remoteTransmissionRequest = rtrmode;

    if (rtrmode) {
        can_msg->DataA = 0x00000000;
        can_msg->DataB = 0x00000000;
    }
    else {
        can_msg->DataA = rxMessage.Data[0] | (rxMessage.Data[1] << 8) | (rxMessage.Data[2] << 16) | (rxMessage.Data[3] << 24);
        can_msg->DataB = rxMessage.Data[4] | (rxMessage.Data[5] << 8) | (rxMessage.Data[6] << 16) | (rxMessage.Data[7] << 24);
    }

    can_msg->length = len;

    state->rxCount++;
    state->rxIn++;

    if (state->rxIn == state->rxBufferSize) {
        state->rxIn = 0;
    }

    raiseMessageReceivedEvent = true;

raiseEvent:
    if (raiseErrorEvent)
        STM32F7_Can_EventCallback(state->taskManager, apiManager, state->errorCallbackTaskReference, (void*)state);

    if (raiseMessageReceivedEvent)
        STM32F7_Can_EventCallback(state->taskManager, apiManager, state->messageReceivedCallbackTaskReference, (void*)state);
}

void STM32F7_Can_TxInterruptHandler0(void *param) {
    CAN_ErrorHandler(0);
}

void STM32F7_Can_TxInterruptHandler1(void *param) {
    CAN_ErrorHandler(1);
}

void STM32F7_Can_RxInterruptHandler0(void *param) {
    STM32F7_Can_RxInterruptHandler(0);
}

void STM32F7_Can_RxInterruptHandler1(void *param) {
    STM32F7_Can_RxInterruptHandler(1);
}

TinyCLR_Result STM32F7_Can_Acquire(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        if (!STM32F7_GpioInternal_OpenMultiPins(canPins[controllerIndex], 2))
            return TinyCLR_Result::SharingViolation;

        // set pin as analog
        STM32F7_GpioInternal_ConfigurePin(canPins[controllerIndex][CAN_TX_PIN].number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::PullUp, canPins[controllerIndex][CAN_TX_PIN].alternateFunction);
        STM32F7_GpioInternal_ConfigurePin(canPins[controllerIndex][CAN_RX_PIN].number, STM32F7_Gpio_PortMode::AlternateFunction, STM32F7_Gpio_OutputType::PushPull, STM32F7_Gpio_OutputSpeed::High, STM32F7_Gpio_PullDirection::PullUp, canPins[controllerIndex][CAN_RX_PIN].alternateFunction);

        state->rxCount = 0;
        state->rxIn = 0;
        state->rxOut = 0;
        state->baudrate = 0;
        state->rxBufferSize = canDefaultBuffersSize[controllerIndex];
        state->controller = self;
        state->enable = false;

        state->canRxMessagesFifo = nullptr;

        STM32F7_Can_SetReadBufferSize(self, canDefaultBuffersSize[controllerIndex]);

