ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_CAN.cpp
        state->wasDataReceivedCallbackTaskEnqueued = false;
        state->wasErrorCallbackTaskEnqueued = false;

        state->lastReadRxBufferCount = 0;
        state->errorEvent = 0;
        state->lastEventTime = STM32F7_Time_GetCurrentProcessorTime();

        state->errorEventHandler = nullptr;
        state->messageReceivedEventHandler = nullptr;

        state->canDataFilter.matchFiltersSize = 0;
        state->canDataFilter.groupFiltersSize = 0;
    }

    state->initializeCount++;

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Can_Release(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->initializeCount == 0) return TinyCLR_Result::InvalidOperation;

    state->initializeCount--;

    if (state->initializeCount == 0) {
        auto controllerIndex = state->controllerIndex;

        self->Disable(self);

        // Release memory
        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        if (state->canRxMessagesFifo != nullptr) {
            memoryProvider->Free(memoryProvider, state->canRxMessagesFifo);

            state->canRxMessagesFifo = nullptr;
        }

        STM32F7_Can_SetMessageReceivedHandler(self, nullptr);
        STM32F7_Can_SetErrorReceivedHandler(self, nullptr);

        CAN_DisableExplicitFilters(controllerIndex);
        CAN_DisableGroupFilters(controllerIndex);

        STM32F7_GpioInternal_ClosePin(canPins[controllerIndex][CAN_TX_PIN].number);
        STM32F7_GpioInternal_ClosePin(canPins[controllerIndex][CAN_RX_PIN].number);
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Can_WriteMessage(const TinyCLR_Can_Controller* self, const TinyCLR_Can_Message* messages, size_t& len) {
    if (len != 1) return TinyCLR_Result::NotSupported;

    auto& m = messages[0];
    uint32_t arbitrationId = m.ArbitrationId;
    bool isExtendedId = m.IsExtendedId;
    bool isRemoteTransmissionRequest = m.IsRemoteTransmissionRequest;
    const uint8_t* data = m.Data;
    size_t length = m.Length;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (!state->enable) return TinyCLR_Result::InvalidOperation;

    auto controllerIndex = state->controllerIndex;

    uint32_t* data32 = (uint32_t*)data;

    CAN_TypeDef* CANx = ((controllerIndex == 0) ? CAN1 : CAN2);

    uint32_t i = 0;

    uint8_t txmailbox;

    STM32F7_Can_TxMessage txMessage;

    /* Transmit Structure preparation */
    txMessage.RTR = (isRemoteTransmissionRequest == true) ? CAN_Rtr_Frame : 0;

    if (isExtendedId) {
        txMessage.IDE = CAN_Id_Extended;
        txMessage.ExtId = arbitrationId;
    }
    else {
        txMessage.IDE = CAN_Id_Standard;
        txMessage.StdId = arbitrationId;
    }
    txMessage.DLC = length & 0x0F;

    txMessage.Data[0] = ((data32[0] >> 0) & 0xFF);
    txMessage.Data[1] = ((data32[0] >> 8) & 0xFF);
    txMessage.Data[2] = ((data32[0] >> 16) & 0xFF);
    txMessage.Data[3] = ((data32[0] >> 24) & 0xFF);
    txMessage.Data[4] = ((data32[1] >> 0) & 0xFF);
    txMessage.Data[5] = ((data32[1] >> 8) & 0xFF);
    txMessage.Data[6] = ((data32[1] >> 16) & 0xFF);
    txMessage.Data[7] = ((data32[1] >> 24) & 0xFF);

    txmailbox = CAN_Transmit(CANx, &txMessage);

    while (CAN_TransmitStatus(CANx, txmailbox) != CAN_TxStatus_Ok && i++ < CAN_GetTransferTimeout())
        STM32F7_Time_Delay(nullptr, 1);

    if (txmailbox == CAN_TxStatus_NoMailBox || i == CAN_GetTransferTimeout()) {

        CAN_CancelTransmit(CANx, txmailbox);
        CAN_ErrorHandler(controllerIndex);
        return TinyCLR_Result::InvalidOperation;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Can_ReadMessage(const TinyCLR_Can_Controller* self, TinyCLR_Can_Message* messages, size_t& len) {
    if (len != 1) return TinyCLR_Result::NotSupported;

    auto& m = messages[0];
    uint32_t& arbitrationId = m.ArbitrationId;
    bool& isExtendedId = m.IsExtendedId;
    bool& isRemoteTransmissionRequest = m.IsRemoteTransmissionRequest;
    uint8_t* data = m.Data;
    size_t& length = m.Length;
    uint64_t& timestamp = m.Timestamp;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (!state->enable) return TinyCLR_Result::InvalidOperation;

    STM32F7_Can_Message *can_msg;

    uint32_t* data32 = (uint32_t*)data;

    if (state->rxCount) {
        can_msg = &state->canRxMessagesFifo[state->rxOut];
        state->rxOut++;

        if (state->rxOut == state->rxBufferSize)
            state->rxOut = 0;

        arbitrationId = can_msg->MsgID;
        isExtendedId = can_msg->extendedId;
        isRemoteTransmissionRequest = can_msg->remoteTransmissionRequest;
        length = can_msg->length;

        data32[0] = can_msg->DataA;
        data32[1] = can_msg->DataB;

        timestamp = ((uint64_t)can_msg->TimeStampL) | ((uint64_t)can_msg->TimeStampH << 32);

        {
            DISABLE_INTERRUPTS_SCOPED(irq);

            state->rxCount--;
            state->lastReadRxBufferCount = state->rxCount;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Can_SetBitTiming(const TinyCLR_Can_Controller* self, const TinyCLR_Can_BitTiming* timing) {
    uint32_t phase1 = (timing->Phase1 + timing->Propagation - 1) & 0x0F;
    uint32_t phase2 = (timing->Phase2 - 1) & 0x07;
    uint32_t baudratePrescaler = (timing->BaudratePrescaler - 1) & 0x03FF;
    uint32_t synchronizationJumpWidth = (timing->SynchronizationJumpWidth - 1) & 0x03;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->baudrate = (synchronizationJumpWidth << 24) | (phase2 << 20) | (phase1 << 16) | baudratePrescaler;

    return TinyCLR_Result::Success;
}

size_t STM32F7_Can_GetMessagesToRead(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    return state->rxCount;
}

size_t STM32F7_Can_GetMessagesToWrite(const TinyCLR_Can_Controller* self) {
    return 0;
}

bool STM32F7_Can_CanPostEvent(int8_t controllerIndex) {
    auto state = reinterpret_cast<CanState*>(&canStates[controllerIndex]);
    auto currentTime = STM32F7_Time_GetCurrentProcessorTime();
    bool canPost = (currentTime - state->lastEventTime) > CAN_EVENT_POST_DEBOUNCE_TICKS;

    if (canPost) // only update when debounce is over
        state->lastEventTime = currentTime;

