ghi-electronics/TinyCLR-Ports/Targets/STM32F7xx/STM32F7_CAN.cpp
    return canPost;
}

TinyCLR_Can_Error STM32F7_Can_GetError(uint32_t error) {
    switch (error) {
    case 1:
        return TinyCLR_Can_Error::Overrun;

    case 4:
        return TinyCLR_Can_Error::BusOff;

    case 8:
        return TinyCLR_Can_Error::Passive;

    default:
        return TinyCLR_Can_Error::BufferFull;
    }
}

void STM32F7_Can_EventCallback(const TinyCLR_Task_Manager* self, const TinyCLR_Api_Manager* apiManager, TinyCLR_Task_Reference task, void* arg) {
    auto state = reinterpret_cast<CanState*>(arg);

    if (task == state->messageReceivedCallbackTaskReference) {
        if (state->rxCount > 0 && state->messageReceivedEventHandler != nullptr) {
            auto canPostEvent = STM32F7_Can_CanPostEvent(state->controllerIndex);

            // First byte or canPost, post immediately asap
            if ((state->rxCount == 1 && state->lastReadRxBufferCount == 0) || canPostEvent) {
                state->messageReceivedEventHandler(state->controller, state->rxCount - state->lastReadRxBufferCount, STM32F7_Time_GetSystemTime(nullptr));

                // Clear for next Enqueue
                state->wasDataReceivedCallbackTaskEnqueued = false;
            }

            // If already scheduled => ignored, make sure no more than one event within CAN_EVENT_POST_DEBOUNCE_TICKS
            // If not scheduled and event posted (by wasDataReceivedCallbackTaskEnqueued = false),
            //      schedule one more callback to be sure that no missing last interrupt for the case (!canPostEvent)
            //      and ReadMessage didn't read all data in buffer (because state->rxCount is updated by last interrupt)
            // Last callback will do nothing if no data left by "if (state->rxCount > 0...)" above.
            if (state->wasDataReceivedCallbackTaskEnqueued == false) {
                state->taskManager->Enqueue(state->taskManager, task, STM32F7_Time_GetProcessorTicksForTime(nullptr, CAN_EVENT_POST_DEBOUNCE_TICKS));
                state->wasDataReceivedCallbackTaskEnqueued = true;
            }
        }
    }
    else if (task == state->errorCallbackTaskReference) {
        if (state->errorEvent > 0 && state->errorEventHandler != nullptr) {
            auto canPostEvent = STM32F7_Can_CanPostEvent(state->controllerIndex);

            //If new error detected or called by callback and can post event, post the event.
            if (canPostEvent) {
                auto error = STM32F7_Can_GetError(state->errorEvent);
                state->errorEventHandler(state->controller, error, STM32F7_Time_GetSystemTime(nullptr));

                // Clear error
                state->errorEvent = 0;

                // Clear for next Enqueue
                state->wasErrorCallbackTaskEnqueued = false;
            }
            else {
                // Couldn't post event on time, scheduel callback to do later.
                if (state->wasErrorCallbackTaskEnqueued == false) {
                    state->taskManager->Enqueue(state->taskManager, task, STM32F7_Time_GetProcessorTicksForTime(nullptr, CAN_EVENT_POST_DEBOUNCE_TICKS));

                    state->wasErrorCallbackTaskEnqueued = true;
                }
            }
        }
    }
}

TinyCLR_Result STM32F7_Can_SetMessageReceivedHandler(const TinyCLR_Can_Controller* self, TinyCLR_Can_MessageReceivedHandler handler) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (handler != nullptr) {
        state->messageReceivedEventHandler = handler;
        state->taskManager = (const TinyCLR_Task_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::TaskManager);
        state->taskManager->Create(state->taskManager, STM32F7_Can_EventCallback, (void*)state, false, state->messageReceivedCallbackTaskReference);
    }

    else {
        if (state->messageReceivedEventHandler != nullptr && state->taskManager != nullptr && state->messageReceivedCallbackTaskReference != nullptr) {
            state->taskManager->Free(state->taskManager, state->messageReceivedCallbackTaskReference);

            state->messageReceivedEventHandler = nullptr;
            state->messageReceivedCallbackTaskReference = nullptr;
        }
    }


    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Can_SetErrorReceivedHandler(const TinyCLR_Can_Controller* self, TinyCLR_Can_ErrorReceivedHandler handler) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (handler != nullptr) {
        state->errorEventHandler = handler;
        state->taskManager = (const TinyCLR_Task_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::TaskManager);
        state->taskManager->Create(state->taskManager, STM32F7_Can_EventCallback, (void*)state, false, state->errorCallbackTaskReference);
    }
    else {
        if (state->errorEventHandler != nullptr && state->taskManager != nullptr && state->errorCallbackTaskReference) {
            state->taskManager->Free(state->taskManager, state->errorCallbackTaskReference);

            state->errorEventHandler = nullptr;
            state->errorCallbackTaskReference = nullptr;
        }
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result STM32F7_Can_SetExplicitFilters(const TinyCLR_Can_Controller* self, const uint32_t* filters, size_t count) {
    uint32_t*_matchFilters;

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    _matchFilters = (uint32_t*)memoryProvider->Allocate(memoryProvider, count * sizeof(uint32_t));

    if (!_matchFilters)
        return TinyCLR_Result::OutOfMemory;

    memcpy(_matchFilters, filters, count * sizeof(uint32_t));

    std::sort(_matchFilters, _matchFilters + count);

    {
        DISABLE_INTERRUPTS_SCOPED(irq);

        auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);


        state->canDataFilter.matchFiltersSize = count;
        state->canDataFilter.matchFilters = _matchFilters;
    }

